GEC1MS  DFHMSD CTRL=(FREEKB),  versao main                             - 
               LANG=COBOL,                                             -
               MODE=INOUT,                                             -
               STORAGE=AUTO,                                           -
               TIOAPFX=YES,                                            -
               TYPE=MAP 
GEC1M1  DFHMDI SIZE=(24,80) 
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=8,                                               -
               POS=(1,1),                                              -
               INITIAL='UNIBANCO' 
        DFHMDF ATTRB=(ASKIP,BRT),                                      -
               LENGTH=44,                                              -
               POS=(1,16),                                             -
               INITIAL='GE - Gerenciamento de Escritório de Cobrança' 
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=5,                                               -
               POS=(1,63),                                             -
               INITIAL='Data:' 
T1DATA  DFHMDF ATTRB=(ASKIP,BRT,FSET),                                 -
               LENGTH=10,                                              -
               POS=(1,69) 
        DFHMDF LENGTH=4,                                               -
               POS=(2,1),                                              -
               INITIAL='GEC1' 
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=5,                                               -
               POS=(2,63),                                             -
               INITIAL='Hora:' 
T1HORA  DFHMDF ATTRB=(ASKIP,BRT,FSET),                                 -
               LENGTH=8,                                               -
               POS=(2,69) 
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=36,                                              -
               POS=(4,20),                                             -
               INITIAL='Menu Principal - Log de Atualizações' 
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=79,                                              -
               POS=(5,1),                                              -
               INITIAL='===============================================-
               ================================' 
        DFHMDF LENGTH=11,                                              -
               POS=(8,36),                                             -
               INITIAL='01. Empresa' 
        DFHMDF LENGTH=10,                                              -
               POS=(10,36),                                            -
               INITIAL='02. Região' 
        DFHMDF LENGTH=8,                                               -
               POS=(12,36),                                            -
               INITIAL='03. Fase' 
        DFHMDF LENGTH=15,                                              -
               POS=(14,36),                                            -
               INITIAL='04. Escritório ' 
        DFHMDF LENGTH=6,                                               -
               POS=(18,36),                                            -
               INITIAL='Opção:' 
T1OPCAO DFHMDF ATTRB=(FSET,IC,NORM,NUM,UNPROT),                        -
               LENGTH=2,                                               -
               PICOUT='99',                                            -
               POS=(18,43) 
        DFHMDF LENGTH=1,                                               -
               POS=(18,46) 
        DFHMDF LENGTH=79,                                              -
               POS=(21,1),                                             -
               INITIAL='===============================================-
               ================================' 
        DFHMDF LENGTH=78,                                              -
               POS=(22,1),                                             -
               INITIAL='Enter  PF1   PF2   PF3    PF4   PF5   PF6   PF7-
                  PF8   PF9   PF10  PF11  PF12' 
        DFHMDF LENGTH=5,                                               -
               POS=(23,1),                                             -
               INITIAL='Segue' 
        DFHMDF LENGTH=4,                                               -
               POS=(23,75),                                            -
               INITIAL='Sair' 
        DFHMDF LENGTH=4,                                               -
               POS=(24,1),                                             -
               INITIAL='Msg:' 
T1MENSA DFHMDF ATTRB=(ASKIP,BRT,FSET),                                 -
               LENGTH=74,                                              -
               POS=(24,6) 
        DFHMSD TYPE=FINAL
        END
