GEC2MS  DFHMSD CTRL=(FREEKB),          versao main                     -
               LANG=COBOL,                                             -
               MODE=INOUT,                                             -
               STORAGE=AUTO,                                           -
               TIOAPFX=YES,                                            -
               TYPE=MAP 
GEC2M1  DFHMDI SIZE=(24,80) 
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=8,                                               -
               POS=(1,1),                                              -
               INITIAL='UNIBANCO' 
        DFHMDF ATTRB=(ASKIP,BRT),                                      -
               LENGTH=44,                                              -
               POS=(1,16),                                             -
               INITIAL='GE - Gerenciamento de Escritório de Cobrança' 
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=5,                                               -
               POS=(1,63),                                             -
               INITIAL='Data:' 
T1DATA  DFHMDF ATTRB=(ASKIP,BRT,FSET),                                 -
               LENGTH=10,                                              -
               POS=(1,69) 
        DFHMDF LENGTH=4,                                               -
               POS=(2,1),                                              -
               INITIAL='GEC2' 
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=5,                                               -
               POS=(2,63),                                             -
               INITIAL='Hora:' 
T1HORA  DFHMDF ATTRB=(ASKIP,BRT,FSET),                                 -
               LENGTH=8,                                               -
               POS=(2,69) 
        DFHMDF LENGTH=19,                                              -
               POS=(5,25),                                             -
               INITIAL='Log de Atualizações' 
T1LOGAT DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=10,                                              -
               POS=(5,45) 
        DFHMDF LENGTH=79,                                              -
               POS=(6,1),                                              -
               INITIAL='===============================================-
               ================================' 
        DFHMDF LENGTH=15,                                              -
               POS=(10,25),                                            -
               INITIAL='Período Início:' 
T1PERID DFHMDF ATTRB=(FSET,NORM,NUM,UNPROT),                           -
               JUSTIFY=(RIGHT),                                        -
               LENGTH=2,                                               -
               PICOUT='99',                                            -
               POS=(10,41) 
        DFHMDF LENGTH=1,                                               -
               POS=(10,44),                                            -
               INITIAL='/' 
T1PERIM DFHMDF ATTRB=(FSET,NORM,NUM,UNPROT),                           -
               JUSTIFY=(RIGHT),                                        -
               LENGTH=2,                                               -
               PICOUT='99',                                            -
               POS=(10,46) 
        DFHMDF ATTRB=(ASKIP),                                          -
               LENGTH=1,                                               -
               POS=(10,49),                                            -
               INITIAL='/' 
T1PERIA DFHMDF ATTRB=(FSET,NORM,NUM,UNPROT),                           -
               JUSTIFY=(RIGHT),                                        -
               LENGTH=4,                                               -
               PICOUT='9999',                                          -
               POS=(10,51) 
        DFHMDF LENGTH=1,                                               -
               POS=(10,56),                                            -
               INITIAL=' ' 
        DFHMDF LENGTH=15,                                              -
               POS=(11,25),                                            -
               INITIAL='Final         :' 
T1PERFD DFHMDF ATTRB=(FSET,NORM,NUM,UNPROT),                           -
               JUSTIFY=(RIGHT),                                        -
               LENGTH=2,                                               -
               PICOUT='99',                                            -
               POS=(11,41) 
        DFHMDF LENGTH=1,                                               -
               POS=(11,44),                                            -
               INITIAL='/' 
T1PERFM DFHMDF ATTRB=(FSET,NORM,NUM,UNPROT),                           -
               JUSTIFY=(RIGHT),                                        -
               LENGTH=2,                                               -
               PICOUT='99',                                            -
               POS=(11,46) 
        DFHMDF ATTRB=(ASKIP),                                          -
               LENGTH=1,                                               -
               POS=(11,49),                                            -
               INITIAL='/' 
T1PERFA DFHMDF ATTRB=(FSET,NORM,NUM,UNPROT),                           -
               JUSTIFY=(RIGHT),                                        -
               LENGTH=4,                                               -
               PICOUT='9999',                                          -
               POS=(11,51) 
        DFHMDF LENGTH=1,                                               -
               POS=(11,56),                                            -
               INITIAL=' ' 
        DFHMDF LENGTH=15,                                              -
               POS=(13,25),                                            -
               INITIAL='Usuário       :' 
T1USUAR DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               LENGTH=7,                                               -
               POS=(13,41) 
        DFHMDF LENGTH=1,                                               -
               POS=(13,49),                                            -
               INITIAL=' ' 
        DFHMDF LENGTH=15,                                              -
               POS=(14,25),                                            -
               INITIAL='Tipo de Evento:' 
T1TIPOE DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               LENGTH=1,                                               -
               POS=(14,41) 
        DFHMDF LENGTH=1,                                               -
               POS=(14,43),                                            -
               INITIAL=' ' 
        DFHMDF LENGTH=15,                                              -
               POS=(15,25),                                            -
               INITIAL='Campo         :' 
T1CAMPO DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               LENGTH=9,                                               -
               POS=(15,41) 
        DFHMDF LENGTH=1,                                               -
               POS=(15,51),                                            -
               INITIAL=' ' 
        DFHMDF LENGTH=79,                                              -
               POS=(21,1),                                             -
               INITIAL='===============================================-
               ================================' 
        DFHMDF LENGTH=78,                                              -
               POS=(22,1),                                             -
               INITIAL='Enter  PF1   PF2   PF3    PF4   PF5   PF6   PF7-
                  PF8   PF9   PF10  PF11  PF12' 
        DFHMDF LENGTH=5,                                               -
               POS=(23,1),                                             -
               INITIAL='Segue' 
        DFHMDF LENGTH=13,                                              -
               POS=(23,20),                                            -
               INITIAL='Menu   Limpa ' 
        DFHMDF LENGTH=4,                                               -
               POS=(23,75),                                            -
               INITIAL='Sair' 
        DFHMDF LENGTH=4,                                               -
               POS=(24,1),                                             -
               INITIAL='Msg:' 
T1MENSA DFHMDF ATTRB=(ASKIP,BRT,FSET),                                 -
               LENGTH=74,                                              -
               POS=(24,6) 
        DFHMSD TYPE=FINAL
        END
