GEC3MS  DFHMSD CTRL=(FREEKB),                                          -
               LANG=COBOL,                                             -
               MODE=INOUT,                                             -
               STORAGE=AUTO,                                           -
               TIOAPFX=YES,                                            -
               TYPE=MAP 
GEC3M1  DFHMDI SIZE=(24,80) 
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=8,                                               -
               POS=(1,1),                                              -
               INITIAL='UNIBANCO' 
        DFHMDF ATTRB=(ASKIP,BRT),                                      -
               LENGTH=44,                                              -
               POS=(1,15),                                             -
               INITIAL='GE - Gerenciamento de Escritório de Cobrança' 
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=5,                                               -
               POS=(1,63),                                             -
               INITIAL='Data:' 
T1DATA  DFHMDF ATTRB=(ASKIP,BRT,FSET),                                 -
               LENGTH=10,                                              -
               POS=(1,69) 
        DFHMDF LENGTH=4,                                               -
               POS=(2,1),                                              -
               INITIAL='GEC3' 
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               LENGTH=5,                                               -
               POS=(2,63),                                             -
               INITIAL='Hora:' 
T1HORA  DFHMDF ATTRB=(ASKIP,BRT,FSET),                                 -
               LENGTH=8,                                               -
               POS=(2,69) 
        DFHMDF LENGTH=79,                                              -
               POS=(3,1),                                              -
               INITIAL='===============================================-
               ================================' 
        DFHMDF LENGTH=74,                                              -
               POS=(5,1),                                              -
               INITIAL='Data/Hora  Usuário/Nome        Evento Entidade -
                 Campo      Anterior/Atual' 
T1DATA1 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=10,                                              -
               POS=(7,1) 
T1USUA1 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=8,                                               -
               POS=(7,12) 
T1EVEN1 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=6,                                               -
               POS=(7,32) 
T1ENTI1 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=10,                                              -
               POS=(7,39) 
T1CAMP1 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=9,                                               -
               POS=(7,50) 
T1ANTE1 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=20,                                              -
               POS=(7,60) 
T1HORA1 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=5,                                               -
               POS=(8,6) 
T1NOME1 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=20,                                              -
               POS=(8,12) 
T1ATUA1 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=20,                                              -
               POS=(8,60) 
T1DATA2 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=10,                                              -
               POS=(10,1) 
T1USUA2 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=8,                                               -
               POS=(10,12) 
T1EVEN2 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=6,                                               -
               POS=(10,32) 
T1ENTI2 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=10,                                              -
               POS=(10,39) 
T1CAMP2 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=9,                                               -
               POS=(10,50) 
T1ANTE2 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=20,                                              -
               POS=(10,60) 
T1HORA2 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=5,                                               -
               POS=(11,6) 
T1NOME2 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=20,                                              -
               POS=(11,12) 
T1ATUA2 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=20,                                              -
               POS=(11,60) 
T1DATA3 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=10,                                              -
               POS=(13,1) 
T1USUA3 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=8,                                               -
               POS=(13,12) 
T1EVEN3 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=6,                                               -
               POS=(13,32) 
T1ENTI3 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=10,                                              -
               POS=(13,39) 
T1CAMP3 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=9,                                               -
               POS=(13,50) 
T1ANTE3 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=20,                                              -
               POS=(13,60) 
T1HORA3 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=5,                                               -
               POS=(14,6) 
T1NOME3 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=20,                                              -
               POS=(14,12) 
T1ATUA3 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=20,                                              -
               POS=(14,60) 
T1DATA4 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=10,                                              -
               POS=(16,1) 
T1USUA4 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=8,                                               -
               POS=(16,12) 
T1EVEN4 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=6,                                               -
               POS=(16,32) 
T1ENTI4 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=10,                                              -
               POS=(16,39) 
T1CAMP4 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=9,                                               -
               POS=(16,50) 
T1ANTE4 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=20,                                              -
               POS=(16,60) 
T1HORA4 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=5,                                               -
               POS=(17,6) 
T1NOME4 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=20,                                              -
               POS=(17,12) 
T1ATUA4 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=20,                                              -
               POS=(17,60) 
T1DATA5 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=10,                                              -
               POS=(19,1) 
T1USUA5 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=8,                                               -
               POS=(19,12) 
T1EVEN5 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=6,                                               -
               POS=(19,32) 
T1ENTI5 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=10,                                              -
               POS=(19,39) 
T1CAMP5 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=9,                                               -
               POS=(19,50) 
T1ANTE5 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=20,                                              -
               POS=(19,60) 
T1HORA5 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=5,                                               -
               POS=(20,6) 
T1NOME5 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=20,                                              -
               POS=(20,12) 
T1ATUA5 DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               LENGTH=20,                                              -
               POS=(20,60) 
        DFHMDF LENGTH=79,                                              -
               POS=(21,1),                                             -
               INITIAL='===============================================-
               ================================' 
        DFHMDF LENGTH=79,                                              -
               POS=(22,1),                                             -
               INITIAL='Enter  PF1     PF2  PF3      PF4  PF5 PF6   PF7-
                  PF8    PF9   PF10  PF11  PF12' 
        DFHMDF LENGTH=8,                                               -
               POS=(23,8),                                             -
               INITIAL='Menu Ant' 
        DFHMDF LENGTH=10,                                              -
               POS=(23,21),                                            -
               INITIAL='Menu Prin ' 
        DFHMDF LENGTH=3,                                               -
               POS=(23,45),                                            -
               INITIAL='Ant' 
        DFHMDF LENGTH=4,                                               -
               POS=(23,51),                                            -
               INITIAL='Próx' 
        DFHMDF LENGTH=4,                                               -
               POS=(23,76),                                            -
               INITIAL='Sair' 
        DFHMDF LENGTH=4,                                               -
               POS=(24,1),                                             -
               INITIAL='Msg:' 
T1MENSA DFHMDF ATTRB=(ASKIP,BRT,FSET),                                 -
               LENGTH=74,                                              -
               POS=(24,6) 
        DFHMSD TYPE=FINAL
        END
